src/DataProcessors/ОбменыДанными_ED_ВыполнитьПроверкуРасчетаУслугиЭДЦенаВТоваре.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DataProcessor>
		<Properties>
			<Name>ОбменыДанными_ED_ВыполнитьПроверкуРасчетаУслугиЭДЦенаВТоваре</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаН</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаК</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/InformationRegisters/ЭкспрессДоставкаОбмен.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ЭкспрессДоставкаОбмен</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаОтправкиСообщения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПакета_исх</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПакета_вх</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Error</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Description</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДанныеПакета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>express_delivery_request_id</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>operation_type</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/ИсточникиРеализаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ИсточникиРеализаций</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Сайт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ВидыОплатыЭД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ВидыОплатыЭД</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Рубли</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Бонусы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВЦенеТовара</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/DataProcessors/ОбменыДанными_ED_ВыполнитьПроверкуРасчетаУслугиЭДЦенаВТоваре/Ext/ObjectModule.bsl
Процедура ВыполнитьПроверку() экспорт
	
	Если НЕ ЗначениеЗаполнено(ДатаН) тогда
		ДатаН = ДобавитьМесяц(ТекущаяДата(),-1);
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ДатаК) тогда
		ДатаК = КонецДня(ТекущаяДата())+1;
	КонецЕсли;
	
	
Запрос = Новый Запрос;
Запрос.Текст = 
"ВЫБРАТЬ
|	РеализацияТоваровУслуг.Ссылка,
|	РеализацияТоваровУслуг.express_delivery_request_id,
|	РеализацияТоваровУслуг.ЭД_init,
|	РеализацияТоваровУслуг.ЭД_СуммаБесплатнойЭД,
|	РеализацияТоваровУслуг.ЭД_СтоимостьУслугиЭДрубли
|ПОМЕСТИТЬ эд
|ИЗ
|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
|ГДЕ
|	РеализацияТоваровУслуг.Дата МЕЖДУ &ДатаН И &ДатаК
|	И РеализацияТоваровУслуг.ТипДоставки = &ТипДоставки
|	И РеализацияТоваровУслуг.Источник = &Источник
|	И РеализацияТоваровУслуг.ЭД_ВидОплаты = &ЭД_ВидОплаты
|	И РеализацияТоваровУслуг.ЭД_СтоимостьУслугиЭДрубли > 0
|	И РеализацияТоваровУслуг.Проведен = ИСТИНА
|	//И РеализацияТоваровУслуг.express_delivery_request_id = ""ED138710""
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ
|	эд.Ссылка,
|	эд.express_delivery_request_id,
|	эд.ЭД_init,
|	эд.ЭД_СуммаБесплатнойЭД,
|	эд.ЭД_СтоимостьУслугиЭДрубли,
|	РеализацияТоваровУслугТовары.НомерСтроки,
|	РеализацияТоваровУслугТовары.Количество,
|	РеализацияТоваровУслугТовары.Цена,
|	РеализацияТоваровУслугТовары.ЦенаСоСкидкой,
|	РеализацияТоваровУслугТовары.ЭД_Цена_Номенклатура,
|	РеализацияТоваровУслугТовары.ЭД_Сумма_Услуга,
|	РеализацияТоваровУслугТовары.Сумма,
|	РеализацияТоваровУслугТовары.ЦенаСоСкидкой * РеализацияТоваровУслугТовары.Количество КАК СуммаРасчетная
|ПОМЕСТИТЬ тч
|ИЗ
|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
|		ЛЕВОЕ СОЕДИНЕНИЕ эд КАК эд
|		ПО РеализацияТоваровУслугТовары.Ссылка = эд.Ссылка
|ГДЕ
|	РеализацияТоваровУслугТовары.Ссылка В
|			(ВЫБРАТЬ
|				эд.Ссылка
|			ИЗ
|				эд)
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ
|	тч.express_delivery_request_id,
|	МАКСИМУМ(тч.ЭД_СуммаБесплатнойЭД) КАК ЭД_СуммаБесплатнойЭД,
|	МАКСИМУМ(тч.ЭД_СтоимостьУслугиЭДрубли) КАК ЭД_СтоимостьУслугиЭДрубли,
|	СУММА(тч.Сумма) КАК Сумма,
|	СУММА(тч.СуммаРасчетная) КАК СуммаРасчетная,
|	СУММА(тч.ЭД_Сумма_Услуга) КАК ЭД_Сумма_Услуга,
|	ВЫБОР
|		КОГДА СУММА(тч.СуммаРасчетная) - СУММА(тч.Сумма) = СУММА(тч.ЭД_Сумма_Услуга) и СУММА(тч.ЭД_Сумма_Услуга) = МАКСИМУМ(тч.ЭД_СтоимостьУслугиЭДрубли) ТОГДА ИСТИНА
|		ИНАЧЕ ЛОЖЬ
|	КОНЕЦ КАК НеХватаетУслуги
|ИЗ
|	тч КАК тч
|
|СГРУППИРОВАТЬ ПО
|	тч.express_delivery_request_id
|
|ИМЕЮЩИЕ
|	НЕ СУММА(тч.СуммаРасчетная) = СУММА(тч.Сумма)
|	И СУММА(тч.Сумма) < МАКСИМУМ(тч.ЭД_СуммаБесплатнойЭД)
|	И 
|	ВЫБОР
|		КОГДА СУММА(тч.СуммаРасчетная) - СУММА(тч.Сумма) = СУММА(тч.ЭД_Сумма_Услуга) и СУММА(тч.ЭД_Сумма_Услуга) = МАКСИМУМ(тч.ЭД_СтоимостьУслугиЭДрубли) ТОГДА ИСТИНА
|		ИНАЧЕ ЛОЖЬ
|	КОНЕЦ = Истина";

Запрос.УстановитьПараметр("Источник", Перечисления.ИсточникиРеализаций.Сайт);
Запрос.УстановитьПараметр("ТипДоставки", Справочники.ТипыДоставки.ЭкспрессДоставка);
Запрос.УстановитьПараметр("ЭД_ВидОплаты", Перечисления.ВидыОплатыЭД.ВЦенеТовара);
Запрос.УстановитьПараметр("ДатаК", ДатаК);
Запрос.УстановитьПараметр("ДатаН", ДатаН);
Результат = Запрос.Выполнить().Выгрузить();	

Сообщить("за период " + СокрЛП(ПредставлениеПериода(ДатаН,ДатаК)) + " найдено проблемных ЭД : " + СокрЛП(Результат.Количество()));

сч = 0;
счсч = 0;
Для каждого ЭД из Результат цикл
	сч = сч + 1;
	Ответ = Истина;
	Ответ = SMSоповещение.РассчитатьУслугуЭД(ЭД.express_delivery_request_id, Ложь);
	Сообщить(СокрлП(сч) + ". " + СокрлП(ЭД.express_delivery_request_id) + " = " + СокрЛП(Ответ) );
	Если НЕ Ответ тогда
		счсч = счсч + 1;	
	КонецЕсли;
КонецЦикла;
Сообщить(" обработано = "+ СокрлП(сч));
Сообщить(" из них отказов = "+ СокрлП(счсч));
	
КонецПроцедуры

Процедура ВыполнитьПроверку_2() экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЭкспрессДоставкаОбмен.express_delivery_request_id,
	|	ЭкспрессДоставкаОбмен.operation_type,
	|	ЭкспрессДоставкаОбмен.Error,
	|	ЭкспрессДоставкаОбмен.Description,
	|	ЭкспрессДоставкаОбмен.Период
	|ПОМЕСТИТЬ ерр
	|ИЗ
	|	РегистрСведений.ЭкспрессДоставкаОбмен КАК ЭкспрессДоставкаОбмен
	|ГДЕ
	|	ЭкспрессДоставкаОбмен.Период > &Период
	|	И ЭкспрессДоставкаОбмен.Error = &Error
	|	И ЭкспрессДоставкаОбмен.Description ПОДОБНО &Description
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЭкспрессДоставкаОбмен.express_delivery_request_id
	|ПОМЕСТИТЬ закр
	|ИЗ
	|	РегистрСведений.ЭкспрессДоставкаОбмен КАК ЭкспрессДоставкаОбмен
	|ГДЕ
	|	ЭкспрессДоставкаОбмен.express_delivery_request_id В
	|			(ВЫБРАТЬ
	|				ерр.express_delivery_request_id
	|			ИЗ
	|				ерр)
	|	И (ЭкспрессДоставкаОбмен.operation_type = &ExpressDelivery_1cConfirm
	|			ИЛИ ЭкспрессДоставкаОбмен.operation_type = &ExpressDelivery_1cCancel)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ерр.express_delivery_request_id,
	|	ерр.operation_type,
	|	ерр.Error,
	|	ерр.Description,
	|	ерр.Период
	|ИЗ
	|	ерр КАК ерр
	|ГДЕ
	|	НЕ ерр.express_delivery_request_id В
	|			(ВЫБРАТЬ
	|				закр.express_delivery_request_id
	|			ИЗ
	|				закр)";

	Запрос.УстановитьПараметр("Error", Истина);
	Запрос.УстановитьПараметр("Период", НачалоДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("Description", "все РТУ проведены;ошибка расчета стоимости услуги");
	Запрос.УстановитьПараметр("ExpressDelivery_1cCancel", "ExpressDelivery.1cCancel");
	Запрос.УстановитьПараметр("ExpressDelivery_1cConfirm", "ExpressDelivery.1cConfirm");
	РезультатТаблица = Запрос.Выполнить().Выгрузить();

	сч = 0;
	Для Каждого СтрокаРезультата Из РезультатТаблица Цикл

	   //алгоритм обработки строки результата - начало ------>

	   //алгоритм обработки строки результата - конец <------

	   сч = сч + 1;

		СтруктураОтчета_express_delivery_request_id = СтрокаРезультата.express_delivery_request_id;
		Сообщить(СокрлП(сч) + ". " + СтруктураОтчета_express_delivery_request_id);
		Ответ = SMSоповещение.РассчитатьУслугуЭД(СтруктураОтчета_express_delivery_request_id);
		Сообщить(Ответ);
		
		Если Ответ = Истина Тогда
			 
			 НаборЗаписей = РегистрыСведений.ЭкспрессДоставкаОбмен.СоздатьНаборЗаписей(); 
			 НаборЗаписей.Отбор.Период.Установить(СтрокаРезультата.Период);
			 НаборЗаписей.Отбор.express_delivery_request_id.Установить(СтрокаРезультата.express_delivery_request_id);
			 НаборЗаписей.Отбор.operation_type.Установить(СтрокаРезультата.operation_type);
			 НаборЗаписей.Прочитать();
			 
			 НовыйНомер = НаборЗаписей[0];
			 НовыйНомер.Error = Ложь;
			 НовыйНомер.Description = "все РТУ проведены";
			 НаборЗаписей.Записать();
			 
			 Сообщить("Error = Ложь");
		КонецЕсли;


	КонецЦикла;

КонецПроцедуры

Процедура ВыполнитьРегламентноеЗадание() Экспорт
	
	ВыполнитьПроверку();
	
	ВыполнитьПроверку_2();
	
КонецПроцедуры
